# グローバル変数

# yahoo APIで取得するデータ
data_pattern = [
    # {"pattern": "15s", "interval": "1m", "period": "5d"},
    # {"pattern": "30s", "interval": "1m", "period": "5d"},
    # {"pattern": "1m", "interval": "1m", "period": "5d"},
    {"pattern": "5m", "interval": "5m", "period": "5d"},
    # {"pattern": "15m", "interval": "15m", "period": "5d"},
    # {"pattern": "30m", "interval": "30m", "period": "5d"},
    # {"pattern": "60m", "interval": "60m", "period": "1mo"},
    # {"pattern": "1d", "interval": "1d", "period": "6mo"},
]

# 11銘柄まで登録可能
# 12銘柄以上登録するとAPIがtokenエラーになるため注意。原因不明。
code_list = [
    ["3382", 100, "3382.T"],  # セブン＆アイ・ＨＬＤＧＳ
    ["5401", 100, "5401.T"],  # 日本製鉄
    ["6098", 100, "6098.T"],  # リクルート
    ["6326", 100, "6326.T"],  # クボタ
    ["7203", 100, "7203.T"],  # トヨタ自動車
    ["7267", 100, "7267.T"],  # 本田技研
    ["9101", 100, "9101.T"],  # 日本郵船
    ["9104", 100, "9104.T"],  # 商船三井
    ["9107", 100, "9107.T"],  # 川崎汽船
    ["9201", 100, "9201.T"],  # 日本航空
    # ["9202", 100, "9202.T"],  # ＡＮＡホールディングス
    # ["9432", 100, "9432.T"],  # 日本電信電話
]
